#include<DxLib.h>
#include "PazzleBase.h"

//コンストラクタ
//********************************************************
PazzleBase::PazzleBase(void)
{

}
//デストラクタ
//********************************************************
PazzleBase::~PazzleBase(void)
{

}

//初期化
//********************************************************
bool PazzleBase::Init(void)
{

	//正しく処理が終了したので
	return true;
}
//更新
//********************************************************
void PazzleBase::Update(void)
{

}
//描画
//********************************************************
void PazzleBase::Draw(void)
{

}
//解放
//********************************************************
bool PazzleBase::Release(void)
{

	//正しく処理が終了したので
	return true;
}
