#include<DxLib.h>
#include "Pazzle.h"

//コンストラクタ
//********************************************************
Pazzle::Pazzle(void)
{

}
//デストラクタ
//********************************************************
Pazzle::~Pazzle(void)
{

}

//初期化
//********************************************************
bool Pazzle::Init(void)
{

	//正しく処理が終了したので
	return true;
}
//更新
//********************************************************
void Pazzle::Update(void)
{

}
//描画
//********************************************************
void Pazzle::Draw(void)
{

}
//解放
//********************************************************
bool Pazzle::Release(void)
{

	//正しく処理が終了したので
	return true;
}
