#include<DxLib.h>
#include"Stealth.h"

//コンストラクタ
//********************************************************
Stealth::Stealth(void)
{

}
//デストラクタ
//********************************************************
Stealth::~Stealth(void)
{

}

//初期化
//********************************************************
bool Stealth::Init(void)
{

	//正しく処理が終了したので
	return true;
}
//更新
//********************************************************
void Stealth::Update(void)
{

}
//描画
//********************************************************
void Stealth::Draw(void)
{

}
//解放
//********************************************************
bool Stealth::Release(void)
{

	//正しく処理が終了したので
	return true;
}