#include<DxLib.h>
#include"StageBase.h"

//コンストラクタ
//********************************************************
StageBase::StageBase(void)
{

}
//デストラクタ
//********************************************************
StageBase::~StageBase(void)
{

}

//初期化
//********************************************************
bool StageBase::Init(void)
{

	//正しく処理が終了したので
	return true;
}
//更新
//********************************************************
void StageBase::Update(void)
{

}
//描画
//********************************************************
void StageBase::Draw(void)
{

}
//解放
//********************************************************
bool StageBase::Release(void)
{

	//正しく処理が終了したので
	return true;
}